"common.ok" = "OK";
"common.cancel" = "Cancel";
"common.save" = "Save";
"common.done" = "Done";
"common.na" = "N/A";
"app.language" = "app.language";

"language.section" = "Language";
"language.system" = "System";
"language.english" = "English";
"language.russian" = "Russian";

"panel.title" = "UAV Digital Twin Simulator";
"panel.keyboard_hint" = "WASD/QE fly, Shift boost, 1..6 cameras, M map, / compass, arrows FPV look, +/- zoom";
"panel.workflow_hint" = "Main controls are in the top toolstrip. Use toolbar buttons to show or hide parameters.";
"panel.toggle_collapse" = "Collapse/Expand Control Panel";
"panel.collapse" = "Collapse Panel";
"panel.expand" = "Expand Panel";
"panel.parameters.on" = "Parameters: On";
"panel.parameters.off" = "Parameters: Off";
"panel.hide" = "Hide parameters panel";
"panel.show" = "Show parameters panel";
"panel.drone_profile" = "UAV Profile";
"panel.model" = "Model";
"panel.mass" = "Mass";
"panel.max_flight" = "Max flight";
"panel.max_wind" = "Wind resistance";
"panel.camera_layout" = "Camera layout";
"panel.visual_class" = "Visual class";
"panel.commands" = "Commands";
"panel.position" = "Position";
"panel.orientation" = "Orientation";
"panel.throttle" = "Throttle";
"panel.camera" = "Camera";
"panel.camera_mode" = "Camera mode";
"panel.weather" = "Weather";
"panel.terrain" = "Terrain";
"panel.diagnostics" = "Diagnostics";
"panel.fleet" = "Fleet";
"panel.damage" = "Damage & Health";
"panel.warnings" = "Warnings";
"panel.telemetry" = "Telemetry";

"axis.x" = "X";
"axis.y" = "Y";
"axis.z" = "Z";
"axis.roll" = "Roll";
"axis.pitch" = "Pitch";
"axis.yaw" = "Yaw";

"camera.mode.free" = "Free";
"camera.mode.follow" = "Tail / Chase";
"camera.mode.third_person" = "Third Person";
"camera.mode.fpv" = "FPV";
"camera.mode.orbit" = "Orbit";
"camera.mode.top" = "Top";
"camera.mode.payload" = "Payload Drop";
"camera.mode.top_down" = "Top Down";
"camera.payload.auto_switch" = "Auto-switch to payload view after release";
"camera.fov" = "FOV";
"camera.sensitivity" = "Sensitivity";
"camera.smoothing" = "Smoothing";
"camera.orbit_distance" = "Orbit distance";
"camera.follow_x" = "Follow offset X";
"camera.follow_y" = "Follow offset Y";
"camera.follow_z" = "Follow offset Z";
"camera.fpv_stabilization" = "FPV stabilization";
"camera.fpv_shake" = "FPV shake";

"command.reset" = "Reset";
"command.takeoff" = "Takeoff";
"command.land" = "Land";
"command.hover" = "Hover";
"command.auto_path" = "Auto Path";
"command.return_home" = "Return Home";
"command.emergency_stop" = "Emergency Stop";
"command.start_animation" = "Start Simulation";
"command.stop_animation" = "Stop Simulation";

"weather.normal" = "Normal";
"weather.wind" = "Wind";
"weather.rain" = "Rain";
"weather.snow" = "Snow";
"weather.fog" = "Fog";
"weather.smog" = "Smog";
"weather.thunderstorm" = "Thunderstorm";
"weather.intensity" = "Intensity";
"weather.wind_direction" = "Wind direction";
"weather.wind_speed" = "Wind speed";
"weather.gusts" = "Gusts";

"terrain.grid_demo" = "Grid Demo";
"terrain.field" = "Field";
"terrain.forest" = "Forest";
"terrain.cargo_yard" = "Cargo Yard";
"terrain.city" = "City";
"terrain.density" = "Object density";
"terrain.seed" = "Seed";
"terrain.scale" = "Map scale";
"terrain.scale.4x4" = "4x4";
"terrain.scale.8x8" = "8x8";
"terrain.scale.16x16" = "16x16";
"terrain.scale.32x32" = "32x32";
"terrain.scale.64x64" = "64x64";
"terrain.scale.128x128" = "128x128";
"terrain.scale.256x256" = "256x256";
"environment.boundary_barrier_visible" = "Show boundary barrier";

"diagnostic.mode" = "Diagnostic mode";
"diagnostic.mode.normal" = "Normal view";
"diagnostic.mode.thermal" = "Thermal / Load";
"diagnostic.mode.damage" = "Damage / Integrity";
"diagnostic.collision_debug" = "Collision debug";
"diagnostic.toggle_thermal" = "Thermal Layer";
"diagnostic.toggle_damage" = "Damage Layer";
"diagnostic.fleet_mode" = "Enable fleet";

"fleet.formation" = "Formation";
"fleet.mode.off" = "Off";
"fleet.mode.line" = "Line";
"fleet.mode.triangle" = "Triangle";
"fleet.separation" = "Separation";
"fleet.wingmen" = "Wingmen";
"fleet.risk" = "Inter-drone risk";
"fleet.nearest" = "Nearest separation";

"damage.reset" = "Reset damage";
"damage.clear_selection" = "Clear selection";
"damage.hide" = "Hide";

"component.battery" = "Battery";
"component.gimbal" = "Front camera / gimbal";
"component.fc_core" = "Flight controller core";
"component.motor_fl" = "Motor FL";
"component.motor_fr" = "Motor FR";
"component.motor_rl" = "Motor RL";
"component.motor_rr" = "Motor RR";
"component.propeller_fl" = "Propeller FL";
"component.propeller_fr" = "Propeller FR";
"component.propeller_rl" = "Propeller RL";
"component.propeller_rr" = "Propeller RR";
"component.arm_fl" = "Arm FL";
"component.arm_fr" = "Arm FR";
"component.arm_rl" = "Arm RL";
"component.arm_rr" = "Arm RR";
"component.esc_power" = "ESC / power electronics";

"warning.nominal" = "OK";
"warning.warning" = "Warn";
"warning.critical" = "Crit";
"warning.collision_high" = "High collision risk";
"warning.impact_detected" = "Impact detected";
"warning.stability_degraded" = "Stability degraded";
"warning.control_reduced" = "Control authority reduced";
"warning.weather_severe" = "Severe weather conditions";
"warning.battery_low" = "Low battery";
"warning.integrity_low" = "Structural integrity low";
"warning.fixedwing_low_speed" = "Fixed-wing low-speed / stall risk";
"warning.fleet_risk" = "Fleet separation risk";
"warning.interdrone_critical" = "Critical inter-drone proximity";
"warning.payload_self_interference" = "Payload released too close to carrier";
"warning.emergency" = "Emergency mode active";
"warnings.none" = "No active warnings";
"summary.damage.none" = "No critical damage";

"signal_loss.warning" = "Signal will be lost in %d...";
"signal_loss.warning_stage_title" = "Boundary warning band";
"signal_loss.warning_stage_detail" = "Reduced link margin. Flight remains available inside the amber band.";
"signal_loss.critical_stage_title" = "Critical edge approach";
"signal_loss.critical_stage_detail" = "Link degradation is increasing. Return inside the perimeter before boundary crossing.";
"signal_loss.boundary_stage_title" = "Red boundary crossed";
"signal_loss.boundary_stage_detail" = "Lost-link countdown is active. Re-enter the map perimeter to reset it.";
"signal_loss.lost_title" = "Signal lost";
"signal_loss.lost_message" = "The UAV has left the map bounds. Flight controls are locked until the signal is restored.";
"signal_loss.impact_title" = "SIGNAL LOST: AIRFRAME FAILURE";
"signal_loss.impact_message" = "Impact damage interrupted the control link and onboard systems.";
"signal_loss.recover" = "Restore signal";

"telemetry.position" = "Position";
"telemetry.velocity" = "Velocity";
"telemetry.attitude" = "Attitude";
"telemetry.speed" = "Speed";
"telemetry.throttle" = "Throttle";
"telemetry.mode" = "Mode";
"telemetry.state" = "State";
"telemetry.battery" = "Battery";
"telemetry.power" = "Power draw";
"telemetry.remaining" = "Remaining time";
"telemetry.weather" = "Weather";
"telemetry.collision_risk" = "Collision risk";
"telemetry.nearest_obstacle" = "Nearest obstacle";
"telemetry.emergency" = "Emergency action";
"telemetry.mission_status" = "Mission status";
"telemetry.damage" = "Damage";
"telemetry.thermal" = "Thermal";
"telemetry.fleet" = "Fleet mode";
"telemetry.fleet_risk" = "Fleet risk";
"telemetry.nearest_interdrone" = "Nearest inter-drone";
"telemetry.export" = "Export Telemetry";
"telemetry.export.success" = "Telemetry exported";
"telemetry.export.failure" = "Telemetry export failed";

"mission.map.open_help" = "Mission map";
"mission.map.title" = "MISSION MAP";
"mission.map.subtitle" = "Planning screen for route and payload delivery zone";
"mission.map.exit" = "EXIT MAP";
"mission.map.clear_route" = "CLEAR ROUTE";
"mission.map.clear_drop_zone" = "CLEAR DROP ZONE";
"mission.map.cancel" = "CANCEL";
"mission.map.confirm" = "CONFIRM MISSION";
"mission.map.instruction.route" = "Click map to set route target";
"mission.map.instruction.drop_zone_center" = "Click map to set drop zone center";
"mission.map.instruction.drop_zone_radius" = "Adjust zone radius and confirm mission";
"mission.map.summary.format" = "UAV %+.1f / %+.1f   HOME %+.1f / %+.1f   MAP %.0f m";
"mission.map.section.route" = "ROUTE";
"mission.map.section.drop_zone" = "DROP ZONE";
"mission.map.section.zone_radius" = "ZONE RADIUS";
"mission.map.section.payload_delivery" = "PAYLOAD DELIVERY";
"mission.map.zone_radius.value" = "%.1f m";
"mission.map.auto_release" = "Auto release over zone center";
"mission.map.payload_ready" = "Attached payload ready for delivery";
"mission.map.payload_unavailable" = "No attached payload for delivery stage";
"mission.map.active_drop_zone" = "ACTIVE DZ";
"mission.map.no_drop_zone" = "NO DZ";
"mission.map.active_route" = "ACTIVE ROUTE";
"mission.map.no_route" = "NO ROUTE";
"mission.map.footer_hint" = "Mission map never drives the UAV directly. Confirmed targets go through the existing guidance layer.";
"mission.map.no_route_target" = "No route target";
"mission.map.no_drop_zone_value" = "No drop zone";
"mission.map.route.value.format" = "X %+.1f   Z %+.1f";
"mission.map.drop_zone.value.format" = "CTR %+.1f / %+.1f   R %.1f m";
"mission.mode.navigation" = "ROUTE";
"mission.mode.drop_zone" = "DROP ZONE";
"mission.status.map_active" = "MISSION MAP ACTIVE";
"mission.status.drop_zone_set" = "DROP ZONE SET";
"mission.status.delivery_ready" = "DELIVERY MISSION READY";
"mission.status.in_drop_zone" = "IN DROP ZONE";
"mission.status.payload_released" = "PAYLOAD RELEASED";
"mission.status.payload_on_target" = "PAYLOAD ON TARGET";
"mission.status.payload_near_target" = "PAYLOAD NEAR TARGET";
"mission.status.payload_off_target" = "PAYLOAD OFF TARGET";

"hud.title" = "Telemetry HUD";
"hud.telemetry" = "Telemetry";
"hud.camera" = "Camera";
"hud.drone" = "Drone";

"mode.manual" = "Manual";
"mode.fixed_wing_heading_hold" = "Heading Hold";
"mode.fixed_wing_altitude_hold" = "Altitude Hold";
"mode.fixed_wing_waypoint_intercept" = "Waypoint Autopilot";
"mode.auto_path" = "Auto Path";
"mode.return_home" = "Return Home";
"mode.hover" = "Hover";
"mode.emergency_stop" = "Emergency Stop";
"mode.takeoff" = "Takeoff";
"mode.landing" = "Landing";

"flight_state.on_ground" = "On ground";
"flight_state.battery_depleted" = "Battery depleted";
"flight_state.ascending" = "Ascending";
"flight_state.descending" = "Descending";
"flight_state.emergency" = "Emergency";
"flight_state.stable" = "Stable";
"flight_state.climbing" = "Climbing";
"flight_state.cruise" = "Cruise";

"emergency.none" = "None";
"emergency.slow_down" = "Slow down";
"emergency.hover" = "Hover";
"emergency.avoid" = "Avoid";
"emergency.stop" = "Emergency stop";

"battery.depleted.title" = "Battery depleted";
"battery.depleted.message" = "Battery is fully depleted. Choose how to continue simulation.";
"battery.depleted.charge" = "Charge drone";
"battery.depleted.restart" = "Restart scenario";

"abstract.edit" = "Edit Parameters";
"abstract.editor.title" = "Abstract UAV Parameters";
"abstract.editor.mass" = "Mass";
"abstract.editor.dimensions" = "Dimensions";
"abstract.editor.energy" = "Energy and Limits";
"abstract.editor.control" = "Control";
"abstract.validation.vertical" = "Ascent/descent speeds are too low.";
"abstract.validation.speed" = "Horizontal speed must be >= ascent/descent speeds.";
"abstract.validation.radius" = "Collision radius is too large for selected dimensions.";

"drone.model.lipo_scout4" = "LIPO Scout 4";
"drone.model.lipo_vector3s" = "LIPO Vector 3S";
"drone.model.lipo_atlas3pro" = "LIPO Atlas 3 Pro";
"drone.model.abstract" = "Abstract UAV";

"drone.visual.mini" = "Light compact quadcopter";
"drone.visual.vector" = "Mid-size dual-camera quadcopter";
"drone.visual.atlas" = "Larger professional quadcopter";
"drone.visual.abstract" = "Custom abstract profile";

"drone.camera.single_compact" = "Single compact front gimbal";
"drone.camera.dual_front" = "Dual front camera module";
"drone.camera.triple_front" = "Triple front camera module";
"drone.camera.custom" = "Custom editable camera module";

"ui.toggle_telemetry_hud" = "Toggle compact telemetry HUD";

"camera.zoom_sensitivity" = "Zoom sensitivity";
"camera.free_speed" = "Free camera speed";
"camera.distance" = "Camera distance";
"camera.fpv_yaw_limit" = "FPV yaw limit";
"camera.fpv_pitch_limit" = "FPV pitch limit";
"camera.fpv_near_clip" = "FPV near clip";
"camera.fpv_mount_x" = "FPV mount X";
"camera.fpv_mount_y" = "FPV mount Y";
"camera.fpv_mount_z" = "FPV mount Z";
"camera.fpv_hide_obstructing" = "Hide obstructing drone parts in FPV";

"keybind.section.title" = "Key bindings";
"keybind.open" = "Bindings";
"keybind.category.flight" = "Flight controls";
"keybind.category.camera" = "Camera controls";
"keybind.category.ui" = "UI controls";
"keybind.category.debug" = "Debug / overlays";
"keybind.flight.forward" = "Forward";
"keybind.flight.backward" = "Backward";
"keybind.flight.left" = "Left";
"keybind.flight.right" = "Right";
"keybind.flight.descend" = "Descend";
"keybind.flight.ascend" = "Ascend";
"keybind.flight.yaw_left" = "Yaw left";
"keybind.flight.yaw_right" = "Yaw right";
"keybind.flight.accelerate" = "Accelerate";
"keybind.flight.hover" = "Hover / stabilize";
"keybind.flight.reset" = "Reset drone";
"keybind.camera.mode1" = "Camera 1 (Free)";
"payload.select" = "Payload";
"payload.configure" = "Payload Config";
"payload.toolbar.open" = "Open payload console";
"payload.toolbar.close" = "Close payload console";
"payload.section" = "PAYLOAD CONFIG";
"payload.console.subtitle" = "Mission payload console for the active UAV profile";
"payload.type" = "Payload Type";
"payload.data_source" = "Payload Data Source";
"payload.data.verified" = "VERIFIED";
"payload.data.estimated" = "ESTIMATED";
"payload.data.custom" = "CUSTOM";
"payload.data.estimated_hint" = "Estimated values are used where official payload specs are missing.";
"payload.mass" = "Payload Mass";
"payload.custom_name" = "Custom Name";
"payload.status" = "Payload Status";
"payload.mount.title" = "Mount";
"payload.mount.unavailable" = "UNAVAILABLE";
"payload.mount.ready" = "READY";
"payload.mount.occupied" = "OCCUPIED";
"payload.limits.title" = "UAV Limits";
"payload.base_mass" = "Base Mass";
"payload.battery_mass" = "Battery Mass";
"payload.max_payload" = "Payload Limit";
"payload.max_takeoff" = "Max Takeoff Mass";
"payload.total_mass" = "Total Mass";
"payload.attach" = "Attach";
"payload.release" = "Release";
"payload.remove" = "Remove";
"payload.mass_value" = "%.2f kg";
"payload.state.no_payload" = "NO PAYLOAD";
"payload.state.attached" = "ATTACHED";
"payload.state.removed" = "REMOVED";
"payload.state.released" = "RELEASED";
"payload.state.falling" = "FALLING";
"payload.state.landed" = "LANDED";
"payload.state.cleaned_up" = "CLEANED UP";
"payload.message.attached" = "Payload attached";
"payload.message.released" = "Payload released";
"payload.message.dropped_successfully" = "Payload dropped successfully";
"payload.message.impact_within_target" = "Impact registered within the target zone";
"payload.message.impact_near_target" = "Impact registered near the target zone";
"payload.message.impact_off_target" = "Impact registered outside the target zone";
"payload.message.self_interference_risk" = "Carrier too close to impact footprint";
"payload.message.cleanup_completed" = "Payload cleanup completed";
"payload.message.removed" = "Payload removed";
"payload.message.no_payload_attached" = "No payload attached";
"payload.message.select_uav" = "Select UAV first";
"payload.message.payload_limit_exceeded" = "Payload exceeds UAV payload limit";
"payload.message.takeoff_limit_exceeded" = "Total mass exceeds max takeoff mass";
"payload.message.data_unavailable" = "Payload data unavailable for this UAV profile";
"payload.message.invalid_mass" = "Set a payload mass greater than zero";
"payload.type.cargo_box" = "Cargo Box";
"payload.type.camera_gimbal" = "Camera Gimbal";
"payload.type.thermal_camera" = "Thermal Camera";
"payload.type.lidar_module" = "LiDAR Module";
"payload.type.rescue_pack" = "Rescue Pack";
"payload.type.sensor_module" = "Sensor Module";
"payload.type.radio_relay" = "Radio Relay";
"payload.type.custom" = "Custom";
"payload.placeholder.message" = "This function will be added later.";
"control_mode.angle" = "Angle";
"command.arm" = "Arm";
"command.disarm" = "Disarm";
"telemetry.arm_state" = "Arm state";
"arm_state.armed" = "Armed";
"arm_state.disarmed" = "Disarmed";
"flight_state.disarmed" = "Disarmed";
"flight_state.armed_idle" = "Armed Idle";
"flight_state.crashed" = "Crashed";
"warning.disarmed" = "Aircraft is disarmed";
"warning.integrity_critical" = "Critical structural damage";
"warning.crashed" = "Aircraft crashed";
"warning.emergency_descent" = "Emergency descent";
"warning.crash_state" = "Crash state";
"warning.signal_lost_impact" = "Signal lost: impact damage";
"damage.severity.nominal" = "Nominal";
"damage.severity.light" = "Light";
"damage.severity.medium" = "Medium";
"damage.severity.critical" = "Critical";
"keybind.camera.mode2" = "Camera 2 (Chase)";
"keybind.camera.mode3" = "Camera 3 (Orbit)";
"keybind.camera.mode4" = "Camera 4 (FPV)";
"keybind.camera.mode5" = "Camera 5 (Top)";
"keybind.camera.mode6" = "Camera 6 (Payload Drop)";
"keybind.camera.toggle_fpv" = "Toggle FPV";
"keybind.camera.cycle_mode" = "Cycle camera mode";
"keybind.camera.zoom_in" = "Zoom in";
"keybind.camera.zoom_out" = "Zoom out";
"keybind.camera.yaw_left" = "Yaw left (camera)";
"keybind.camera.yaw_right" = "Yaw right (camera)";
"keybind.camera.pitch_up" = "Pitch up (camera)";
"keybind.camera.pitch_down" = "Pitch down (camera)";
"keybind.camera.reset_orientation" = "Reset camera orientation";
"workspace.toolstrip" = "Toolstrip";
"toolstrip.tab.simulation" = "Simulation";
"toolstrip.tab.flight" = "Flight";
"toolstrip.tab.camera" = "Camera";
"toolstrip.tab.environment" = "Environment";
"toolstrip.tab.debug" = "Debug";
"toolstrip.tab.projects" = "Projects";
"toolstrip.section.run" = "Run Control";
"toolstrip.section.flight_model" = "Airframe & Control";
"toolstrip.section.throttle" = "Throttle";
"toolstrip.section.camera_modes" = "Camera Modes";
"toolstrip.section.camera_quick" = "Camera Presets";
"toolstrip.section.weather" = "Weather";
"toolstrip.section.terrain" = "Terrain";
"toolstrip.section.debug" = "Diagnostics";
"toolstrip.section.projects" = "Project Actions";
"camera.zoom_in" = "Zoom +";
"camera.zoom_out" = "Zoom -";
"camera.reset_orientation" = "Reset View";
"panel.collision_debug" = "Collision Debug";
"window.fullscreen" = "Fullscreen";
"keybind.ui.toggle_panel" = "Collapse / expand panel";
"keybind.ui.toggle_mission_map" = "Toggle mission map";
"keybind.ui.toggle_payload" = "Toggle payload panel";
"keybind.ui.toggle_hud" = "Toggle telemetry HUD";
"keybind.flight.release_payload" = "Release payload";
"keybind.debug.toggle_damage" = "Toggle damage overlay";
"keybind.debug.toggle_thermal" = "Toggle thermal overlay";
"keybind.capture.idle" = "Select an action and press Rebind.";
"keybind.capture.prompt" = "Press a key for \"%@\" (Esc to cancel)";
"keybind.rebind" = "Rebind";
"keybind.capturing" = "Listening…";
"keybind.reset_defaults" = "Reset Defaults";
"keybind.key.space" = "Space";
"keybind.key.code" = "Key %d";

"control_mode.title" = "Flight control mode";
"control_mode.stabilized" = "Stabilized";
"control_mode.acro" = "Acro";
"control_mode.hover_assist" = "Hover Assist";

"common.export" = "Export";

"camera.preset" = "Camera preset";
"camera.preset.cinematic" = "Cinematic";
"camera.preset.pilot" = "Pilot";
"camera.preset.inspection" = "Inspection";
"camera.preset.wide_follow" = "Wide Follow";
"camera.preset.tight_follow" = "Tight Follow";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Reset To Preset";
"camera.advanced" = "Advanced Camera";
"camera.invert_x" = "Invert X";
"camera.invert_y" = "Invert Y";
"camera.sensitivity_profile" = "Sensitivity profile";
"camera.sensitivity.low" = "Low";
"camera.sensitivity.medium" = "Medium";
"camera.sensitivity.high" = "High";

"section.flight" = "Flight";
"section.camera" = "Camera";
"section.environment" = "Environment";
"section.diagnostics" = "Diagnostics";
"section.advanced" = "Advanced";

"diagnostic.last_collision_source" = "Last collision source";
"diagnostic.active_objects" = "Active objects";
"diagnostic.active_physics" = "Active physics bodies";
"diagnostic.active_particles" = "Active particles";

"telemetry.control_mode" = "Control mode";
"telemetry.nearest_obstacle_source" = "Nearest obstacle source";
"telemetry.frame_time" = "Frame";
"telemetry.physics_time" = "Physics";
"telemetry.render_time" = "Render";
"telemetry.path_time" = "Pathfinding";
"telemetry.active_objects" = "Objects";
"telemetry.active_physics_bodies" = "Physics bodies";
"telemetry.particle_count" = "Particles";

"drone.model.fixed_rect" = "Rectangular Wing UAV";
"drone.model.fixed_delta" = "Delta Wing UAV";
"drone.model.fixed_swept" = "Swept Wing UAV";
"drone.visual.fixed_rect" = "Rectangular fixed-wing";
"drone.visual.fixed_delta" = "Delta fixed-wing";
"drone.visual.fixed_swept" = "Swept fixed-wing";
"drone.camera.fixed_front" = "Fixed front camera";

"menu.title" = "UAV Projects";
"menu.saved_projects" = "Saved Projects";
"menu.create_project" = "Create Project";
"menu.recent_project" = "Recent Project";
"menu.search" = "Search project";
"menu.sort" = "Sort";

"project.name" = "Project name";
"project.sort.newest" = "Newest";
"project.sort.name" = "Name";
"project.sort.recent" = "Recently Opened";
"project.create.title" = "Create Project";
"project.create.action" = "Create";
"project.open.action" = "Open Project Browser";
"project.open.failure" = "Failed to open project";
"project.save.action" = "Save Project";
"project.save_as.action" = "Save Project As";
"project.save_as.title" = "Save Project As";
"project.save_as.action" = "Save As";
"project.save.success" = "Project saved";
"project.save.failure" = "Project save failed";
"project.duplicate.title" = "Duplicate Project";
"project.duplicate.action" = "Duplicate Project";
"project.duplicate.success" = "Project duplicated";
"project.duplicate.failure" = "Project duplication failed";
"project.delete.action" = "Delete Project";
"project.delete.failure" = "Failed to delete project";
"project.delete.confirm.title" = "Delete Project";
"project.delete.confirm.message" = "Delete project '%@'?";

"project.unsaved.title" = "Unsaved Changes";
"project.unsaved.message" = "Do you want to save project '%@'?\nUnsaved changes may be lost.";
"project.unsaved.save" = "Save";
"project.unsaved.save_exit" = "Save and Exit";
"project.unsaved.exit_without" = "Exit Without Saving";

"telemetry.export.select_folder" = "Choose export folder for telemetry file.";
"control_mode.acro" = "Acro / Rate";
"control_mode.hover_assist" = "Hover / Alt-Hold";

"section.flight" = "Flight";
"section.camera" = "Camera";
"section.environment" = "Environment";
"section.diagnostics" = "Diagnostics";
"section.advanced" = "Advanced";

"camera.preset" = "Camera preset";
"camera.preset.cinematic" = "Cinematic";
"camera.preset.pilot" = "Pilot";
"camera.preset.inspection" = "Inspection";
"camera.preset.wide_follow" = "Wide Follow";
"camera.preset.tight_follow" = "Tight Follow";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Reset to preset";
"camera.advanced" = "Advanced Camera";
"camera.sensitivity_profile" = "Sensitivity profile";
"camera.sensitivity.low" = "Low";
"camera.sensitivity.medium" = "Medium";
"camera.sensitivity.high" = "High";
"camera.invert_x" = "Invert X";
"camera.invert_y" = "Invert Y";

"diagnostic.last_collision_source" = "Last collision source";
"diagnostic.active_objects" = "Active objects";
"diagnostic.active_physics" = "Active physics bodies";
"diagnostic.active_particles" = "Particle count";

"telemetry.control_mode" = "Control mode";
"telemetry.nearest_obstacle_source" = "Nearest obstacle source";
"telemetry.frame_time" = "Frame time";
"telemetry.physics_time" = "Physics update";
"telemetry.render_time" = "Render update";
"telemetry.path_time" = "Pathfinding";
"telemetry.active_objects" = "Active objects";
"telemetry.active_physics_bodies" = "Physics bodies";
"telemetry.particle_count" = "Particles";

"drone.model.fixed_rect" = "Rectangular Wing UAV";
"drone.model.fixed_delta" = "Delta Wing UAV";
"drone.model.fixed_swept" = "Swept Wing UAV";
"drone.model.ebee_class" = "eBee-class Mapping UAV";
"drone.model.ux11_class" = "UX11-class Survey UAV";
"drone.model.wingtra_class" = "Wingtra-class VTOL UAV";
"drone.model.trinity_class" = "Trinity-class Pro UAV";

"drone.visual.fixed_rect" = "Fixed-wing rectangular family";
"drone.visual.fixed_delta" = "Fixed-wing delta family";
"drone.visual.fixed_swept" = "Fixed-wing swept family";
"drone.visual.ebee_class" = "Tailless flying-wing mapping platform";
"drone.visual.ux11_class" = "Conventional survey fixed-wing platform";
"drone.visual.wingtra_class" = "Tailsitter VTOL fixed-wing platform";
"drone.visual.trinity_class" = "Professional survey eVTOL platform";

"drone.camera.fixed_front" = "Fixed-wing front camera";

"common.not_specified" = "Not specified";

"country.china" = "China";
"country.united_states" = "United States";
"country.norway" = "Norway";
"country.switzerland" = "Switzerland";
"country.germany" = "Germany";
"country.israel" = "Israel";
"country.poland" = "Poland";
"country.canada" = "Canada";
"country.user_defined" = "User Defined";

"uav.filter.type" = "Type";
"uav.filter.mass" = "Mass";
"uav.filter.vehicle.all" = "All";
"uav.filter.vehicle.multicopters" = "Multicopters";
"uav.filter.vehicle.helicopters" = "Helicopters";
"uav.filter.vehicle.fixed_wing" = "Fixed-Wing";
"uav.filter.vehicle.hybrid_vtol" = "Hybrid VTOL";
"uav.filter.mass.all" = "All";
"uav.filter.mass.nano" = "Nano";
"uav.filter.mass.micro" = "Micro";
"uav.filter.mass.light" = "Light";
"uav.filter.mass.medium" = "Medium";
"uav.filter.mass.heavy" = "Heavy";

"uav.vehicle.multicopter" = "Multicopter";
"uav.vehicle.fixed_wing" = "Fixed-Wing";
"uav.vehicle.hybrid_vtol" = "Hybrid VTOL";
"uav.vehicle.helicopter" = "Helicopter";
"uav.vehicle.custom" = "Custom";

"uav.mass.nano" = "Nano";
"uav.mass.micro" = "Micro";
"uav.mass.light" = "Light";
"uav.mass.medium" = "Medium";
"uav.mass.heavy" = "Heavy";
"uav.mass.custom" = "Custom";

"uav.spec.verified" = "Verified";
"uav.spec.partial" = "Partial";
"uav.spec.custom" = "Custom";

"uav.badge.custom" = "CUSTOM";
"uav.catalog.title" = "UAV Catalog";
"uav.catalog.empty" = "No UAV profiles match the current filters.";
"uav.catalog.edit_abstract" = "Edit Abstract UAV";
"uav.catalog.selected_outside_filter" = "Selected model is outside current filter";

"uav.card.title" = "Selected UAV";
"uav.card.manufacturer" = "Manufacturer";
"uav.card.country" = "Country";
"uav.card.type" = "Type";
"uav.card.mass_class" = "Mass class";
"uav.card.base_mass" = "Base mass";
"uav.card.max_payload" = "Max payload";
"uav.card.mtow" = "MTOW";
"uav.card.role" = "Role";
"uav.card.status" = "Status";
"uav.card.payload_data_source" = "Payload data";
"uav.card.armament_note" = "Armament note";
"uav.card.empty" = "No selected UAV profile";

"uav.manufacturer.custom" = "Custom";

"uav.profile.abstract-uav.display_name" = "Abstract UAV";
"uav.profile.dji-matrice-350-rtk.short_description" = "Enterprise quadcopter with landing gear, central gimbal bay, and modular payload support.";
"uav.profile.dji-matrice-350-rtk.mission_role" = "Enterprise inspection, mapping, and public-safety operations";
"uav.profile.dji-flycart-30.short_description" = "Heavy cargo multicopter with coaxial lift groups and a central underslung freight bay.";
"uav.profile.dji-flycart-30.mission_role" = "Cargo transport and logistics";
"uav.profile.dji-mavic-4-pro.short_description" = "Foldable consumer camera multicopter with a triple-camera forward gimbal section.";
"uav.profile.dji-mavic-4-pro.mission_role" = "Consumer aerial imaging and creator capture";
"uav.profile.dji-neo.short_description" = "Ultra-compact protected-prop multicopter designed as a lightweight personal flying camera.";
"uav.profile.dji-neo.mission_role" = "Personal aerial video capture";
"uav.profile.dji-phantom-3-standard.short_description" = "Classic Phantom consumer quadcopter with integrated landing gear and a front gimbal camera bay.";
"uav.profile.dji-phantom-3-standard.mission_role" = "Consumer aerial imaging";
"uav.profile.freefly-alta-x.short_description" = "Heavy-lift open-frame cinema and industrial multirotor with a central underslung payload section.";
"uav.profile.freefly-alta-x.mission_role" = "Heavy-lift cinema and industrial payload carriage";
"uav.profile.griff-30.short_description" = "Heavy-lift cargo UAV with a large transport frame and an underslung load zone.";
"uav.profile.griff-30.mission_role" = "Heavy-lift cargo transport";
"uav.profile.griff-60.short_description" = "Large heavy-lift cargo UAV with a higher-capacity airframe than Griff 30.";
"uav.profile.griff-60.mission_role" = "Heavy-lift cargo transport";
"uav.profile.avidrone-490tl.short_description" = "Tandem-rotor cargo UAV with a long central fuselage and underslung freight position.";
"uav.profile.avidrone-490tl.mission_role" = "Cargo transport and utility lift";
"uav.profile.wingtraone-gen-ii.short_description" = "Hybrid VTOL mapping aircraft with a belly survey compartment and fixed-wing cruise layout.";
"uav.profile.wingtraone-gen-ii.mission_role" = "Survey mapping and photogrammetry";
"uav.profile.quantum-systems-trinity-pro.short_description" = "Long-span eVTOL survey aircraft with a central sensor compartment under the fuselage.";
"uav.profile.quantum-systems-trinity-pro.mission_role" = "Survey mapping and corridor inspection";
"uav.profile.mq-9b-skyguardian.short_description" = "Large MALE fixed-wing platform with long wings, nose sensor architecture, and multi-hardpoint payload capacity.";
"uav.profile.mq-9b-skyguardian.mission_role" = "Long-endurance ISR and multi-mission patrol";
"uav.profile.hermes-900.short_description" = "Multi-role MALE UAV with a long wing, pusher layout, and sensor stations under the nose and fuselage.";
"uav.profile.hermes-900.mission_role" = "Multi-role MALE ISR and maritime patrol";
"uav.profile.ft5-los.short_description" = "Twin-engine tactical fixed-wing platform with a compact surveillance airframe and modular payload integration.";
"uav.profile.ft5-los.mission_role" = "Tactical reconnaissance and ISTAR";
"uav.profile.flyeye.short_description" = "Lightweight fixed-wing observation UAV with a compact fuselage and underbelly electro-optical payload zone.";
"uav.profile.flyeye.mission_role" = "Close-range reconnaissance and observation";
"uav.profile.abstract-uav.short_description" = "User-defined custom UAV profile kept for future parameter tuning.";
"uav.profile.abstract-uav.mission_role" = "User-defined custom mission";

"telemetry.path_status" = "Path status";
"telemetry.path_status.idle" = "Idle";
"telemetry.path_status.valid" = "Valid";
"telemetry.path_status.recomputing" = "Recomputing";
"telemetry.path_status.blocked" = "Blocked";
"telemetry.auto_nav" = "Auto nav";
"telemetry.auto_nav.active" = "ACTIVE";
"telemetry.auto_nav.inactive" = "INACTIVE";
"telemetry.control_authority" = "Control authority";
"telemetry.input_flags" = "Input flags";
"telemetry.state_flags" = "State flags";
"common.on" = "ON";
"common.off" = "OFF";
"telemetry.target_distance" = "Dist to target";
"telemetry.target_bearing" = "Bearing to target";
"telemetry.waypoint" = "Waypoint";
"telemetry.waypoint.value" = "idx %d, left %d";
"telemetry.path_remaining" = "Path remaining";
"telemetry.fixed_wing_state" = "FW mission";
"telemetry.fixed_wing_track" = "FW track";
"telemetry.fixed_wing_track.format" = "course %.0f° | xtrack %.1f m";
"telemetry.fixed_wing_energy" = "FW energy";
"telemetry.fixed_wing_energy.format" = "airspeed %.1f m/s | alt %.1f m";
"telemetry.fixed_wing_commands" = "FW commands";
"telemetry.fixed_wing_commands.format" = "roll %.1f° | pitch %.1f° | thr %.0f%%";
"telemetry.fixed_wing_recovery" = "FW speed recovery";
"telemetry.fixed_wing_progress" = "FW leg progress";
"telemetry.fixed_wing_progress.format" = "along-track %.2f";
"telemetry.fixed_wing_battery" = "FW battery tier";
"telemetry.fixed_wing_transition" = "FW transition";
"telemetry.mode_transition_reason" = "Mode reason";
"telemetry.mission_abort_reason" = "Mission abort";

"panel.modules.on" = "Modules: On";
"panel.modules.off" = "Modules: Off";

"toolbar.cluster.status" = "Live Status";
"toolbar.cluster.status.subtitle" = "Current mission stack and active module";
"toolbar.cluster.project" = "Project Actions";
"toolbar.cluster.project.subtitle" = "Session persistence and workspace control";
"toolbar.cluster.utility" = "Operator Tools";
"toolbar.cluster.utility.subtitle" = "Bindings, HUD and language";

"sidebar.metric.mode" = "Mode";
"sidebar.metric.state" = "State";
"sidebar.metric.camera" = "Camera";
"sidebar.metric.platform" = "Platform";
"sidebar.metric.battery" = "Battery";
"sidebar.metric.warnings" = "Warnings";
"sidebar.metric.throttle" = "Throttle";
"sidebar.metric.preset" = "Preset";
"sidebar.metric.fov" = "FOV";
"sidebar.metric.distance" = "Distance";
"sidebar.metric.weather" = "Weather";
"sidebar.metric.terrain" = "Terrain";
"sidebar.metric.wind" = "Wind";
"sidebar.metric.boundary" = "Boundary";
"sidebar.metric.manufacturer" = "Manufacturer";
"sidebar.value.on" = "On";
"sidebar.value.off" = "Off";

"toolbar.header.project" = "Project actions";

"module.panel.idle" = "MODULES";
"module.panel.idle.subtitle" = "Select a tool from the toolbar to open a control module";

"module.flight_ops.title" = "FLIGHT OPS";
"module.flight_ops.toolbar_title" = "Flight";
"module.flight_ops.subtitle" = "Launch, recovery and thrust control";
"module.flight_ops.command_stack" = "Command Stack";
"module.flight_ops.command_stack.subtitle" = "Primary airframe actions and automatic routines";
"module.flight_ops.fixed_wing_assist" = "Fixed-Wing Autopilot";
"module.flight_ops.fixed_wing_assist.subtitle" = "Smooth waypoint following with carrot-pursuit guidance, plus manual heading and altitude holds";
"module.flight_ops.control_law" = "Flight Control";
"module.flight_ops.control_law.subtitle" = "Switch between control laws without leaving the scene";
"module.flight_ops.active_mode" = "ACTIVE";
"module.flight_ops.thrust" = "Thrust Channel";
"module.flight_ops.thrust.subtitle" = "Direct throttle authority and fixed setpoints";
"module.flight_ops.override" = "Safety / Reset";
"module.flight_ops.override.subtitle" = "Simulation power state, recovery and emergency stop";

"module.uav_catalog.title" = "UAV CATALOG";
"module.uav_catalog.toolbar_title" = "UAV";
"module.uav_catalog.subtitle" = "Platform selection and active airframe context";
"module.uav_catalog.selection" = "Platform Snapshot";
"module.uav_catalog.selection.subtitle" = "Filtered catalog status and current selection";
"module.uav_catalog.metric.active" = "Active Profile";
"module.uav_catalog.metric.filtered" = "Filtered Set";
"module.uav_catalog.metric.type" = "Vehicle Type";
"module.uav_catalog.metric.mass" = "Mass Class";
"module.uav_catalog.list.subtitle" = "Catalog filters, platform list and profile card";

"module.payload.title" = "PAYLOAD";
"module.payload.toolbar_title" = "Payload";

"module.camera.title" = "CAMERA";
"module.camera.toolbar_title" = "Camera";
"module.camera.subtitle" = "Sensor viewpoint, optics and FPV tuning";
"module.camera.mode_stack" = "Mode Stack";
"module.camera.mode_stack.subtitle" = "Operational camera modes for scene control";
"module.camera.active_mode" = "LIVE";
"module.camera.presets" = "Preset Rack";
"module.camera.presets.subtitle" = "Mission-specific camera presets and reset controls";
"module.camera.optics" = "Optics";
"module.camera.optics.subtitle" = "Distance and field-of-view tuning";
"module.camera.advanced.subtitle" = "Expand only when deeper camera tuning is required";
"module.camera.show_advanced" = "Show advanced camera tuning";
"module.camera.hide_advanced" = "Hide advanced camera tuning";
"module.camera.fpv_stack" = "FPV Calibration";
"module.camera.preset_hint.cinematic" = "Wide, smooth and presentation-focused";
"module.camera.preset_hint.pilot" = "Balanced operator view for general flying";
"module.camera.preset_hint.inspection" = "Closer framing for structure checks";
"module.camera.preset_hint.wide_follow" = "Longer chase spacing for situational awareness";
"module.camera.preset_hint.tight_follow" = "Closer chase spacing for precision work";
"module.camera.preset_hint.fpv" = "Cockpit view with direct alignment";

"module.scenario.title" = "SCENARIO";
"module.scenario.toolbar_title" = "Scenario";
"module.scenario.subtitle" = "Weather, terrain and boundary envelope";
"module.scenario.weather" = "Weather Profile";
"module.scenario.weather.subtitle" = "Preset severity and wind conditions";
"module.scenario.show_weather_tuning" = "Show wind tuning";
"module.scenario.hide_weather_tuning" = "Hide wind tuning";
"module.scenario.active_preset" = "LIVE";
"module.scenario.terrain" = "Terrain Profile";
"module.scenario.terrain.subtitle" = "Map scale, density and containment controls";
"module.scenario.active_profile" = "LIVE";

"module.diagnostics.title" = "DIAGNOSTICS";
"module.diagnostics.toolbar_title" = "Diagnostics";
"module.diagnostics.subtitle" = "Telemetry, runtime states and technical health";
"module.diagnostics.overlay" = "Overlay Modes";
"module.diagnostics.overlay.subtitle" = "Runtime rendering and debug visibility controls";
"module.diagnostics.runtime_summary" = "Runtime Summary";
"module.diagnostics.runtime_summary.subtitle" = "Frame, physics, render and object load counters";
"module.diagnostics.telemetry" = "Telemetry Rack";
"module.diagnostics.telemetry.subtitle" = "Expanded mission, power and performance readout";
"module.diagnostics.warning_bus" = "Warning Bus";
"module.diagnostics.warning_bus.subtitle" = "Current alarms from flight, battery and environment";
"module.diagnostics.fleet" = "Fleet Coordination";
"module.diagnostics.fleet.subtitle" = "Wingman behavior and formation spacing";
"module.diagnostics.damage" = "Damage / Thermal";
"module.diagnostics.damage.subtitle" = "Component visibility and integrity inspection";
"module.diagnostics.station" = "Station Settings";
"module.diagnostics.station.subtitle" = "Operator language and local workstation preferences";
"module.diagnostics.panel.overview" = "Overview";
"module.diagnostics.panel.telemetry" = "Telemetry";
"module.diagnostics.panel.fleet" = "Fleet";
"module.diagnostics.panel.service" = "Service";

"project.default_name" = "Project %@";
"project.copy_suffix" = "Copy";
"project.clone_suffix" = "Clone";

"control_authority.none" = "NONE";
"control_authority.manual" = "MANUAL";
"control_authority.marker" = "MARKER";
"control_authority.failsafe" = "FAILSAFE";
"control_authority.blocked" = "BLOCKED";

"payload_camera.state.inactive" = "INACTIVE";
"payload_camera.state.falling" = "FALLING";
"payload_camera.state.impact" = "IMPACT";
"payload_camera.state.rest" = "AT REST";

"overlay.payload_view.title" = "PAYLOAD VIEW";
"overlay.payload_view.metric.alt" = "ALT";
"overlay.payload_view.metric.vertical_speed" = "V/S";
"overlay.payload_view.metric.time" = "TIME";
"overlay.payload_view.metric.state" = "STATE";

"overlay.terrain_map.title" = "TERRAIN MAP";
"overlay.terrain_map.subtitle" = "Filtered obstacle overview and single target marker";
"overlay.terrain_map.clear" = "CLR";
"overlay.terrain_map.target_metrics.empty" = "DST —   BRG —";
"overlay.terrain_map.target_metrics.format" = "DST %.1f m   BRG %03.0f°";
"overlay.terrain_map.heading_alt_objects.format" = "HDG %@°   ALT %.1f m   OBJ %d";
"overlay.terrain_map.position_map.format" = "X %+.1f   Z %+.1f   MAP %@";
"overlay.terrain_map.status.format" = "SIG %@   AUTO NAV %@";

"overlay.compass.title" = "COMPASS";
"overlay.compass.subtitle" = "Heading / north / target bearing";
"overlay.compass.metric.heading" = "HDG";
"overlay.compass.metric.north" = "N";
"overlay.compass.metric.bearing" = "BRG";
"overlay.compass.marker.current" = "HDG";
"overlay.compass.marker.target" = "TGT";

"hud.compact.position" = "POS  x %.1f  y %.1f  z %.1f";
"hud.compact.speed_battery" = "SPD  %.1f m/s   BAT %.0f%%";
"hud.compact.auto_nav" = "AUTO %@  DST %@  BRG %@";

"telemetry.flags.input.format" = "MAN %@ | MRK %@ | PV %@ | MAP %@";
"telemetry.flags.state.format" = "DIS %@ | BLK %@ | SIG %@";
"telemetry.flags.mission.format" = "MAP %@ | DZ %@ | READY %@ | IN %@ | REL %@";

"tactical.map.title" = "TACTICAL MAP";
"tactical.map.subtitle" = "Draft, plan, and mission launch over the existing autopilot.";
"tactical.map.mode.waypoint" = "WAYPOINTS";
"tactical.map.mode.launch_object" = "LAUNCH";
"tactical.map.mode.drop_zone" = "DROP ZONE";
"tactical.map.mode.no_fly_zone" = "NO-FLY";
"tactical.map.instruction.waypoint" = "Click on the map to append the next waypoint.";
"tactical.map.instruction.launch_object" = "Click on the map to place or replace the launch object and corridor heading.";
"tactical.map.instruction.drop_zone" = "Click on the map to place or move the drop zone.";
"tactical.map.instruction.no_fly_zone" = "Click on the map to place another no-fly zone.";
"tactical.map.section.status" = "DRAFT STATUS";
"tactical.map.section.route" = "ROUTE PREVIEW";
"tactical.map.section.zones" = "ZONES";
"tactical.map.section.actions" = "DRAFT ACTIONS";
"tactical.map.zone.drop_zone" = "Drop Zone";
"tactical.map.zone.no_fly_zone" = "No-Fly Zone";
"tactical.map.zone.empty" = "Zone not set.";
"tactical.map.zone.radius.value" = "%.1f m | x %.1f | y %.1f";
"tactical.map.zone.radius.value.multiple" = "%.1f m | x %.1f | y %.1f | count %d";
"tactical.map.metric.span" = "MAP";
"tactical.map.metric.drop_zone" = "DROP";
"tactical.map.metric.link_status" = "LINK";
"tactical.map.metric.safe_return" = "RETURN";
"tactical.map.metric.edge_distance" = "EDGE";
"tactical.map.metric.geofence" = "FENCE";
"tactical.map.metric.mode" = "MODE";
"tactical.map.metric.scale_status" = "SCALE";
"tactical.map.metric.operational_radius" = "OPS";
"tactical.map.metric.route_distance" = "ROUTE";
"tactical.map.metric.preview" = "PREVIEW";
"tactical.map.metric.link_radius" = "LINK";
"tactical.map.metric.waypoints" = "WPTS";
"tactical.map.metric.zones" = "ZONES";
"tactical.map.metric.segments" = "SEGS";
"tactical.map.preview.none" = "No preview";
"tactical.map.preview.unavailable" = "Preview unavailable";
"tactical.map.link.nominal" = "Nominal";
"tactical.map.link.warning" = "Warning";
"tactical.map.link.critical" = "Critical";
"tactical.map.link.lost" = "Lost";
"tactical.map.safe_return.ok" = "Ready";
"tactical.map.safe_return.limit" = "Limited";
"tactical.map.direction.north" = "North";
"tactical.map.direction.south" = "South";
"tactical.map.direction.east" = "East";
"tactical.map.direction.west" = "West";
"tactical.map.geofence.nominal" = "NOMINAL";
"tactical.map.geofence.warning" = "WARNING";
"tactical.map.geofence.critical" = "CRITICAL";
"tactical.map.geofence.outside" = "OUTSIDE";
"tactical.map.legend.boundary" = "Map boundary";
"tactical.map.legend.warning_band" = "Warning band";
"tactical.map.legend.critical_band" = "Critical band";
"tactical.map.legend.route" = "Route / waypoints";
"tactical.map.legend.route_geometry" = "Mission geometry";
"tactical.map.legend.predicted_path" = "Predicted flyable path";
"tactical.map.legend.launch_corridor" = "Launch corridor";
"tactical.map.legend.safe_return" = "Safe return envelope";
"tactical.map.legend.drop_zone" = "Drop zone";
"tactical.map.legend.no_fly" = "No-fly zone";
"tactical.map.legend.payload_impact" = "Payload impact marker";
"tactical.map.overlay.payload_impact" = "Impact event";
"tactical.map.overlay.payload_on_target" = "Impact on target";
"tactical.map.overlay.payload_near_target" = "Impact near target";
"tactical.map.overlay.payload_off_target" = "Impact off target";
"tactical.map.overlay.boundary" = "Boundary";
"tactical.map.overlay.safe_return" = "Safe return";
"tactical.map.overlay.link" = "Link";
"tactical.map.overlay.drop_zone_radius" = "Drop zone";
"tactical.map.overlay.no_fly" = "No-fly";
"tactical.map.route.empty" = "Route draft is empty.";
"tactical.map.badge.draft_dirty" = "DRAFT DIRTY";
"tactical.map.badge.draft_synced" = "DRAFT SAVED";
"tactical.map.section.launch" = "LAUNCH";
"tactical.map.launch.mode" = "MODE";
"tactical.map.launch.object" = "OBJECT";
"tactical.map.launch.position" = "POSITION";
"tactical.map.launch.heading" = "HEADING";
"tactical.map.launch.standard_hint" = "Standard preserves the current legacy start behavior. Select a dedicated launch mode to use mission launch objects and protected initial climb.";
"tactical.map.launch.place_object_hint" = "Select a non-standard launch mode, then place a launch object on the map and set its heading.";
"tactical.map.launch.mode.standard" = "Standard";
"tactical.map.launch.mode.handLaunch" = "Hand Launch";
"tactical.map.launch.mode.catapult" = "Catapult";
"tactical.map.launch.mode.runway" = "Runway";
"tactical.map.launch.mode.vtol" = "VTOL";
"tactical.map.launch.object.handLaunchPoint" = "Hand launch point";
"tactical.map.launch.object.catapultLine" = "Catapult line";
"tactical.map.launch.object.runwayStrip" = "Runway strip";
"tactical.map.launch.object.vtolStartPoint" = "VTOL start point";
"tactical.map.action.clear_launch_object" = "Clear Launch";
"tactical.map.action.save_draft" = "SAVE DRAFT";
"tactical.map.action.cancel" = "CANCEL";
"tactical.map.action.exit" = "EXIT";
"tactical.map.action.remove_last_waypoint" = "REMOVE LAST WAYPOINT";
"tactical.map.action.clear_route" = "CLEAR ROUTE";
"tactical.map.action.clear_zones" = "CLEAR ZONES";
"tactical.map.status.empty.title" = "Draft is empty";
"tactical.map.status.empty.detail" = "Add at least one waypoint to build a preview route.";
"tactical.map.status.preview_unavailable.title" = "Preview unavailable";
"tactical.map.status.preview_unavailable.detail" = "The draft is incomplete. The map is not allowed to publish a preview yet.";
"tactical.map.status.invalid.title" = "Draft invalid";
"tactical.map.status.invalid.detail" = "The draft contains blocking issues. The route is not saved.";
"tactical.map.status.ready.title" = "Preview ready";
"tactical.map.status.ready.detail" = "Draft is structurally valid. Preview route and zones are ready for operator review.";
"tactical.map.issue.none" = "No blocking issues.";
"tactical.map.issue.route_missing" = "Add at least one waypoint before saving the mission draft.";
"tactical.map.issue.waypoint_out_of_bounds" = "One or more waypoints are outside the technical world bounds.";
"tactical.map.issue.waypoint_spacing" = "Consecutive waypoints are too close to each other.";
"tactical.map.issue.zone_radius_invalid" = "One of the zones has a radius outside the allowed engineering range.";
"tactical.map.issue.zone_out_of_bounds" = "One or more zones are outside the technical world bounds.";
"tactical.map.issue.route_intersects_no_fly" = "The mission route intersects at least one no-fly zone.";
"tactical.map.issue.invalid_altitude_window" = "Mission altitude constraints are invalid. Minimum altitude must not exceed maximum altitude.";
"tactical.map.issue.target_altitude_out_of_range" = "Mission travel altitude falls outside the configured altitude window.";
"tactical.map.issue.invalid_speed_window" = "Mission speed constraints are invalid or exceed the current airframe envelope.";
"tactical.map.issue.route_exceeds_safe_return" = "Route plus safe return exceeds the current safe range budget.";
"tactical.map.issue.route_margin_tight" = "Route leaves only a narrow reserve for safe return.";
"tactical.map.issue.route_exceeds_operational_radius" = "Route extends beyond the recommended operational radius for the selected UAV.";
"tactical.map.issue.link_degraded" = "Route extends into the degraded link zone.";
"tactical.map.issue.launch_object_required" = "Selected launch mode requires a launch object on the tactical map.";
"tactical.map.issue.launch_object_out_of_bounds" = "Launch object is outside the current tactical map bounds.";
"tactical.map.issue.launch_object_conflicts_no_fly" = "Launch object or corridor conflicts with a no-fly zone.";
"tactical.map.issue.launch_corridor_invalid" = "Launch corridor exits the mission area too early or crosses the boundary immediately.";
"tactical.map.issue.launch_space_insufficient" = "Selected launch object does not have enough straight-line space for the chosen launch semantics.";
"tactical.map.issue.map_tight" = "Current map size is tight for the selected UAV profile.";
"tactical.map.issue.map_unsuitable" = "Current map size is unsuitable for the selected UAV profile.";
"mission.plan.status.draft" = "Draft";
"mission.plan.status.invalid" = "Invalid";
"mission.plan.status.ready" = "Ready";
"mission.plan.status.validated" = "Validated";
"mission.binding.status.unbound" = "Unbound";
"mission.binding.status.bound" = "Bound";
"mission.binding.status.failed" = "Failed";
"mission.execution.readiness.draft" = "Draft";
"mission.execution.readiness.validated" = "Validated";
"mission.execution.readiness.unbound" = "Unbound";
"mission.execution.readiness.ready" = "Ready";
"mission.execution.readiness.failed" = "Binding failed";
"mission.readiness.draft" = "Draft";
"mission.readiness.invalid" = "Invalid";
"mission.readiness.blocked" = "Blocked";
"mission.readiness.ready" = "Ready";
"mission.execution.status.idle" = "Idle";
"mission.execution.status.ready" = "Prepared";
"mission.execution.status.running" = "Running";
"mission.execution.status.paused" = "Paused";
"mission.execution.status.completed" = "Completed";
"mission.execution.status.aborted" = "Aborted";
"mission.execution.status.blocked" = "Blocked";
"mission.execution.status.failed" = "Failed";
"mission.execution.status.no_authority" = "No authority";
"mission.truth.status.draft" = "Draft";
"mission.truth.status.invalid" = "Invalid";
"mission.truth.status.validated" = "Validated";
"mission.truth.status.execution_unbound" = "Unbound";
"mission.truth.status.blocked" = "Blocked";
"mission.truth.status.ready" = "Ready";
"mission.truth.status.running" = "Running";
"mission.truth.status.paused" = "Paused";
"mission.truth.status.returning_home" = "Returning";
"mission.truth.status.completed" = "Completed";
"mission.truth.status.aborted" = "Aborted";
"mission.truth.status.failed" = "Failed";
"mission.truth.status.no_authority" = "No authority";
"mission.truth.status.no_target" = "No target";
"mission.truth.status.route_invalid" = "Route invalid";
"mission.truth.status.runtime_distance_unavailable" = "No distance";
"mission.truth.status.failed_binding" = "Binding failed";
"mission.truth.status.runtime_unsafe" = "Unsafe";
"mission.failsafe.none" = "None";
"mission.failsafe.hold" = "Hold";
"mission.failsafe.pause" = "Pause";
"mission.failsafe.abort" = "Abort";
"mission.failsafe.return_home" = "Return home";
"mission.status.reason.draft_empty" = "Mission draft is empty.";
"mission.status.reason.no_validated_plan" = "No validated mission plan is available.";
"mission.status.reason.preview_unavailable" = "Preview route is unavailable. Mission plan cannot be prepared yet.";
"mission.status.reason.route_missing" = "Mission route has no waypoints.";
"mission.status.reason.route_invalid" = "Mission route contains invalid or zero-length segments.";
"mission.status.reason.zone_invalid" = "One or more mission zones are invalid.";
"mission.status.reason.plan_not_prepared" = "Mission draft is saved, but execution plan has not been prepared yet.";
"mission.status.reason.plan_not_ready" = "Mission plan is not ready for execution.";
"mission.status.reason.execution_contour_missing" = "Mission plan is validated, but the execution contour has not been built yet.";
"mission.status.reason.execution_binding_failed" = "Mission plan was validated, but execution binding failed.";
"mission.status.reason.execution_not_started" = "Mission plan is prepared and waiting for Start.";
"mission.status.reason.invalid_altitude_window" = "Mission altitude constraints are invalid.";
"mission.status.reason.invalid_speed_window" = "Mission speed constraints are invalid.";
"mission.status.reason.target_altitude_out_of_range" = "Mission travel altitude is outside the configured altitude window.";
"mission.status.reason.altitude_constraints_applied" = "Mission altitude limits are accepted and applied to mission travel altitude.";
"mission.status.reason.speed_max_constraint_applied" = "Mission maximum speed limit is accepted and applied to autopilot command scaling.";
"mission.status.reason.speed_min_constraint_advisory" = "Mission minimum speed limit is accepted as an operational advisory, but the baseline autopilot cannot fully guarantee it in every contour.";
"mission.status.reason.no_active_execution_target" = "Execution contour exists, but there is no active mission target.";
"mission.status.reason.no_mission_target" = "Mission layer has no active target to hand over to the autopilot.";
"mission.status.reason.runtime_distance_unavailable" = "Execution contour exists, but runtime distance to the active target is unavailable.";
"mission.status.reason.no_target_bound" = "Mission execution has no active autopilot target bound.";
"mission.status.reason.no_control_authority" = "Mission target is bound, but the live autopilot does not currently own control authority.";
"mission.status.reason.authority_flap_detected" = "Mission authority briefly fluctuated but recovered before a confirmed loss. Execution continues.";
"mission.status.reason.runtime_stall_detected" = "Mission progress has not changed for too long. Execution appears stalled.";
"mission.status.reason.battery_unsafe" = "Battery/runtime reserve is not sufficient for safe mission continuation.";
"mission.status.reason.route_exceeds_safe_return" = "Mission route plus return exceeds the current safe range budget.";
"mission.status.reason.route_margin_tight" = "Mission route leaves only a narrow safe-return reserve.";
"mission.status.reason.route_exceeds_operational_radius" = "Mission route extends beyond the recommended operational radius.";
"mission.status.reason.link_degraded" = "Mission route extends into degraded link coverage.";
"mission.status.reason.map_tight" = "Current map size is tight for the selected UAV profile.";
"mission.status.reason.map_unsuitable" = "Current map size is unsuitable for the selected UAV profile.";
"mission.status.reason.mission_start_blocked" = "Mission start is blocked by the current safety/runtime state.";
"mission.status.reason.mission_aborted_by_safety" = "Mission was aborted by the safety coordinator.";
"mission.status.reason.mission_paused_by_operator" = "Mission was paused by the operator.";
"mission.status.reason.mission_paused_by_runtime" = "Mission was paused by the runtime safety layer.";
"mission.status.reason.return_home_triggered" = "Mission execution stopped and return-home was triggered.";
"mission.status.reason.runtime_unsafe" = "Runtime state is unsafe for mission execution.";
"mission.status.reason.unknown_runtime_mismatch" = "Mission layer and the live autopilot contour are out of sync.";
"mission.status.reason.execution_blocked" = "Mission cannot start or resume until the UAV can accept target-marker auto-navigation.";
"mission.status.reason.waypoint_reached" = "Waypoint reached. Switching to the next target.";
"mission.status.reason.mission_paused" = "Mission is paused. The active target is retained, but autopilot guidance is not running.";
"mission.status.reason.mission_completed" = "Mission completed. All waypoints were reached.";
"mission.status.reason.mission_aborted" = "Mission aborted by operator.";
"mission.status.reason.mission_failed" = "Mission failed.";
"mission.status.field.control" = "CONTROL";
"mission.status.field.active_target" = "TARGET";
"mission.status.field.distance" = "DIST";
"mission.status.field.progress" = "PROGRESS";
"mission.status.field.plan" = "PLAN";
"mission.status.field.execution" = "EXEC";
"fixed_wing.assist.mode" = "ASSIST";
"fixed_wing.assist.target" = "TARGET";
"fixed_wing.assist.status" = "STATUS";
"fixed_wing.assist.feasibility" = "INTERCEPT GEOMETRY";
"fixed_wing.assist.active_waypoint" = "ACTIVE WAYPOINT";
"fixed_wing.assist.auto_advance" = "Auto-advance to next waypoint";
"fixed_wing.assist.waypoint_mode" = "Waypoint mode";
"fixed_wing.assist.waypoint_mode.fly_by" = "Fly-by";
"fixed_wing.assist.auto_advance.status.paused_poor_geometry" = "Auto-advance paused: poor next-waypoint geometry";
"fixed_wing.assist.auto_advance.status.paused_obstacle_ahead" = "Auto-advance paused: obstacle ahead";
"fixed_wing.assist.waypoint.none" = "No waypoint selected";
"fixed_wing.assist.action.previous" = "PREVIOUS";
"fixed_wing.assist.action.next" = "NEXT";
"fixed_wing.assist.action.intercept_selected" = "INTERCEPT SELECTED";
"fixed_wing.assist.state.single_point_intercept" = "SINGLE-POINT INTERCEPT";
"fixed_wing.assist.state.inbound_leg_track" = "INBOUND LEG TRACK";
"fixed_wing.assist.state.flyby_turn_transition" = "FLY-BY TURN TRANSITION";
"fixed_wing.assist.state.outbound_leg_track" = "OUTBOUND LEG TRACK";
"fixed_wing.assist.state.terminal_capture" = "TERMINAL CAPTURE";
"fixed_wing.assist.state.route_complete" = "ROUTE COMPLETE";
"fixed_wing.assist.state.auto_advance_paused_poor_geometry" = "AUTO-ADVANCE PAUSED (GEOMETRY)";
"fixed_wing.assist.state.auto_advance_paused_obstacle" = "AUTO-ADVANCE PAUSED (OBSTACLE)";
"fixed_wing.assist.feasibility.feasible" = "Feasible";
"fixed_wing.assist.feasibility.tight_turn" = "Tight turn";
"fixed_wing.assist.feasibility.poor_geometry" = "Poor geometry";
"fixed_wing.assist.feasibility.warning" = "The bend at this waypoint exceeds a safe bank angle. The autopilot will gently round the corner instead of forcing a sharp slip turn.";
"fixed_wing.assist.hint" = "The autopilot tracks waypoints through a moving aim point (carrot pursuit). Sharper polylines simply produce wider turn radii instead of jerks.";
"fixed_wing.assist.debug.active_index" = "activeWaypointIndex";
"fixed_wing.assist.debug.auto_advance_enabled" = "autoAdvanceEnabled";
"fixed_wing.assist.debug.next_index" = "nextWaypointIndex";
"fixed_wing.assist.debug.has_prev_waypoint" = "hasPrevWaypoint";
"fixed_wing.assist.debug.has_next_waypoint" = "hasNextWaypoint";
"fixed_wing.assist.debug.is_penultimate_waypoint" = "isPenultimateWaypoint";
"fixed_wing.assist.debug.is_final_waypoint" = "isFinalWaypoint";
"fixed_wing.assist.debug.flyby_center_waypoint_index" = "flyByCenterWaypointIndex";
"fixed_wing.assist.debug.active_triple_indices" = "activeTripleIndices";
"fixed_wing.assist.debug.active_id" = "activeWaypointID";
"fixed_wing.assist.debug.captured_ids" = "capturedWaypointIDs";
"fixed_wing.assist.debug.intercept_state" = "interceptState";
"fixed_wing.assist.debug.capture_completed_reason" = "captureCompletedReason";
"fixed_wing.assist.debug.feasibility" = "interceptFeasibilityState";
"fixed_wing.assist.debug.distance" = "distanceToActiveWaypoint";
"fixed_wing.assist.debug.heading_error" = "headingErrorDeg";
"fixed_wing.assist.debug.raw_heading_error" = "rawHeadingErrorDeg";
"fixed_wing.assist.debug.turn_radius" = "estimatedTurnRadius";
"fixed_wing.assist.debug.commanded_bank" = "bankCommandDeg";
"fixed_wing.assist.debug.filtered_bank" = "filteredBankCommandDeg";
"fixed_wing.assist.debug.turn_direction" = "commandedTurnDirection";
"fixed_wing.assist.debug.transition_reason" = "stateTransitionReason";
"fixed_wing.assist.debug.auto_advance_suppressed" = "autoAdvanceSuppressed";
"fixed_wing.assist.debug.auto_advance_suppressed_reason" = "autoAdvanceSuppressedReason";
"fixed_wing.assist.debug.heading_error_to_next_waypoint" = "headingErrorToNextWaypoint";
"fixed_wing.assist.debug.next_waypoint_in_forward_sector" = "nextWaypointInForwardSector";
"fixed_wing.assist.debug.enough_turn_in_distance" = "enoughTurnInDistance";
"fixed_wing.assist.debug.collision_risk_to_next_waypoint" = "collisionRiskToNextWaypoint";
"fixed_wing.assist.debug.obstacle_in_turn_corridor" = "obstacleInTurnCorridor";
"fixed_wing.assist.debug.blocked_path_to_next_waypoint" = "blockedPathToNextWaypoint";
"fixed_wing.assist.debug.lateral_guidance_suppressed_for_poor_geometry" = "lateralGuidanceSuppressedForPoorGeometry";
"fixed_wing.assist.debug.current_leg_start" = "currentLegStart";
"fixed_wing.assist.debug.current_leg_middle" = "currentLegMiddle";
"fixed_wing.assist.debug.current_leg_end" = "currentLegEnd";
"fixed_wing.assist.debug.inbound_course_deg" = "inboundCourseDeg";
"fixed_wing.assist.debug.outbound_course_deg" = "outboundCourseDeg";
"fixed_wing.assist.debug.course_change_deg" = "courseChangeDeg";
"fixed_wing.assist.debug.lead_distance" = "leadDistance";
"fixed_wing.assist.debug.flyby_transition_active" = "flyByTransitionActive";
"fixed_wing.assist.debug.turn_transition_active" = "turnTransitionActive";
"fixed_wing.assist.debug.flyby_transition_feasible" = "flyByTransitionFeasible";
"fixed_wing.assist.debug.active_guidance_mode" = "activeGuidanceMode";
"fixed_wing.assist.debug.preview_uses_cached_flyby_plan" = "previewUsesCachedFlyByPlan";
"fixed_wing.assist.debug.controller_uses_cached_flyby_plan" = "controllerUsesCachedFlyByPlan";
"fixed_wing.assist.debug.guidance_direct_to_waypoint_suppressed" = "guidanceDirectToWaypointSuppressed";
"fixed_wing.assist.debug.terminal_capture_allowed" = "terminalCaptureAllowed";
"fixed_wing.assist.debug.guidance_type" = "activeGuidanceTargetType";
"fixed_wing.assist.debug.using_obsolete_fixed_wing_mode" = "usingObsoleteFixedWingMode";
"fixed_wing.assist.debug.flyby_plan_recompute_count" = "flyByPlanRecomputeCount";
"fixed_wing.assist.debug.full_route_rebuild_count" = "fullRouteRebuildCount";
"fixed_wing.assist.debug.overlay_rebuild_count" = "overlayRebuildCount";
"fixed_wing.assist.debug.guidance_recompute_count" = "guidanceRecomputeCount";
"fixed_wing.assist.debug.frame_time" = "frameTimeMs";
"fixed_wing.assist.debug.heavy_map_rebuild_count" = "heavyMapRebuildCount";
"fixed_wing.assist.debug.frame_time_during_transition" = "frameTimeMsDuringTransition";
"mission.status.field.validated_plan" = "VALIDATED";
"mission.status.field.binding" = "BINDING";
"mission.status.field.execution_contour" = "CONTOUR";
"mission.status.field.execution_target" = "TARGET SRC";
"mission.status.field.runtime_distance" = "DIST SRC";
"mission.status.field.start_permission" = "START";
"mission.status.field.link" = "LINK";
"mission.status.field.remaining_range" = "RANGE";
"mission.status.field.safe_return" = "RETURN";
"mission.status.field.map_scale" = "MAP";
"mission.status.field.truth" = "TRUTH";
"mission.status.field.readiness" = "READINESS";
"mission.status.field.authority_state" = "AUTH";
"mission.status.field.failsafe" = "FAILSAFE";
"mission.status.field.mission_status" = "MISSION";
"mission.status.field.mission_type" = "TYPE";
"mission.status.field.waypoint_count" = "WAYPOINTS";
"mission.status.field.route_length" = "ROUTE LENGTH";
"mission.status.field.drop_zone" = "DROP ZONE";
"mission.status.field.no_fly_status" = "NO-FLY";
"mission.status.field.link_quality" = "LINK QUALITY";
"mission.status.field.home_distance" = "TO HOME";
"mission.status.field.edge_distance" = "TO EDGE";
"mission.status.field.safe_return_state" = "SAFE RETURN";
"mission.status.field.validation" = "VALIDATION";
"mission.status.field.map_scale_active" = "MAP SCALE";
"mission.status.field.profile" = "PROFILE";
"mission.status.field.feasibility" = "FEASIBILITY";
"mission.status.field.primary_issue" = "PRIMARY ISSUE";
"mission.status.value.present" = "Present";
"mission.status.value.absent" = "Absent";
"mission.status.value.bound" = "Bound";
"mission.status.value.unbound" = "Unbound";
"mission.status.value.available" = "Available";
"mission.status.value.unavailable" = "Unavailable";
"mission.status.value.granted" = "Granted";
"mission.status.value.blocked" = "Blocked";
"mission.status.value.none" = "None";
"mission.status.value.route" = "Route";
"mission.status.value.delivery" = "Delivery";
"mission.status.value.route_restricted" = "Restricted route";
"mission.status.value.delivery_restricted" = "Delivery / restricted";
"mission.status.value.zone_count" = "%d zones";
"mission.status.value.issue_count" = "%d issues";
"mission.status.value.validated" = "Validated";
"mission.status.value.feasible" = "Feasible";
"mission.status.value.limited" = "Limited";
"mission.status.chip.prepare" = "PREP";
"mission.status.chip.start" = "START";
"mission.status.chip.bound" = "BOUND";
"mission.status.chip.failsafe" = "SAFE";
"mission.authority.state.idle" = "Not required";
"mission.authority.state.mission" = "Mission owner";
"mission.authority.state.flap" = "Authority flap";
"mission.authority.state.target_lost" = "Target lost";
"mission.authority.state.lost" = "Authority lost";
"mission.panel.section.status" = "MISSION STATUS";
"mission.panel.section.constraints" = "MISSION CONSTRAINTS";
"mission.panel.section.execution" = "MISSION EXECUTION";
"mission.constraints.altitude.minimum" = "Minimum altitude";
"mission.constraints.altitude.maximum" = "Maximum altitude";
"mission.constraints.speed.minimum" = "Minimum speed";
"mission.constraints.speed.maximum" = "Maximum speed";
"mission.constraints.unit.meters" = "m";
"mission.constraints.unit.speed" = "m/s";
"mission.constraints.hint" = "Constraints are stored in mission state, validated before execution, and forwarded to the autopilot layer where the baseline contour supports them.";
"mission.panel.plan.summary" = "%d waypoints | %d route points";
"mission.panel.plan.empty" = "Mission plan not prepared.";
"mission.panel.action.prepare" = "PREPARE MISSION";
"mission.panel.action.start" = "START";
"mission.panel.action.pause" = "PAUSE";
"mission.panel.action.resume" = "RESUME";
"mission.panel.action.abort" = "ABORT";
"module.diagnostics.mission" = "MISSION CONTOUR";
"module.diagnostics.mission.subtitle" = "Truth status, safety, authority, and failsafe reasons.";
"module.diagnostics.mission_history" = "MISSION TIMELINE";
"module.diagnostics.mission_history.subtitle" = "Structured event log and post-flight debrief for the current mission session.";
"mission.event.category.planning" = "PLANNING";
"mission.event.category.operator" = "OPERATOR";
"mission.event.category.execution" = "EXEC";
"mission.event.category.safety" = "SAFETY";
"mission.event.category.failsafe" = "FAILSAFE";
"mission.event.category.payload" = "PAYLOAD";
"mission.event.category.diagnostics" = "DIAG";
"mission.event.severity.info" = "INFO";
"mission.event.severity.warning" = "WARNING";
"mission.event.severity.critical" = "CRITICAL";
"mission.event.code.missionDraftPrepared" = "DRAFT PREPARED";
"mission.event.code.missionValidated" = "MISSION VALIDATED";
"mission.event.code.missionStartRequested" = "START REQUESTED";
"mission.event.code.missionStarted" = "MISSION STARTED";
"mission.event.code.controlAuthorityGranted" = "AUTHORITY GRANTED";
"mission.event.code.controlAuthorityLost" = "AUTHORITY LOST";
"mission.event.code.controlAuthorityFlap" = "AUTHORITY FLAP";
"mission.event.code.waypointActivated" = "WAYPOINT ACTIVE";
"mission.event.code.waypointReached" = "WAYPOINT REACHED";
"mission.event.code.segmentCompleted" = "SEGMENT COMPLETED";
"mission.event.code.missionPaused" = "MISSION PAUSED";
"mission.event.code.missionResumed" = "MISSION RESUMED";
"mission.event.code.missionBlocked" = "MISSION BLOCKED";
"mission.event.code.missionWarningRaised" = "WARNING RAISED";
"mission.event.code.runtimeUnsafeDetected" = "RUNTIME UNSAFE";
"mission.event.code.failsafeTriggered" = "FAILSAFE TRIGGERED";
"mission.event.code.returnHomeTriggered" = "RETURN HOME";
"mission.event.code.missionAborted" = "MISSION ABORTED";
"mission.event.code.missionCompleted" = "MISSION COMPLETED";
"mission.event.code.debriefGenerated" = "DEBRIEF GENERATED";
"mission.event.code.payloadActionTriggered" = "PAYLOAD ACTION";
"mission.event.code.payloadActionCompleted" = "PAYLOAD COMPLETE";
"mission.event.code.diagnosticsCritical" = "DIAGNOSTIC CRITICAL";
"mission.event.detail.missionDraftPrepared" = "Mission draft was prepared for execution review.";
"mission.event.detail.missionValidated" = "Mission plan passed validation and is ready for execution preparation.";
"mission.event.detail.missionStartRequested" = "Operator requested mission start.";
"mission.event.detail.missionStarted" = "Mission execution entered running state.";
"mission.event.detail.controlAuthorityGranted" = "Mission layer has active target authority over the autopilot contour.";
"mission.event.detail.controlAuthorityFlap" = "Authority briefly dropped and recovered within the safety grace window.";
"mission.event.detail.controlAuthorityLost" = "Mission layer lost target authority and can no longer guarantee execution.";
"mission.event.detail.waypointActivated" = "A new mission waypoint became the active target.";
"mission.event.detail.waypointReached" = "Active waypoint was reached.";
"mission.event.detail.segmentCompleted" = "Current route segment completed.";
"mission.event.detail.missionPaused" = "Mission execution transitioned to pause.";
"mission.event.detail.missionResumed" = "Mission execution resumed from pause.";
"mission.event.detail.missionBlocked" = "Mission execution is blocked by the current runtime or safety state.";
"mission.event.detail.missionWarningRaised" = "Mission warning was raised by the runtime safety layer.";
"mission.event.detail.runtimeUnsafeDetected" = "Mission runtime was marked unsafe.";
"mission.event.detail.failsafeTriggered" = "Mission failsafe coordinator triggered a safe branch.";
"mission.event.detail.returnHomeTriggered" = "Mission execution handed off to return-home.";
"mission.event.detail.missionAborted" = "Mission execution aborted.";
"mission.event.detail.missionCompleted" = "Mission execution completed all active waypoints.";
"mission.event.detail.debriefGenerated" = "Mission debrief was generated from the final runtime state.";
"mission.event.detail.payloadActionTriggered" = "Mission payload action started.";
"mission.event.detail.payloadActionCompleted" = "Mission payload action completed.";
"mission.event.detail.diagnosticsCritical" = "Critical diagnostics incident was attached to the mission timeline.";
"mission.timeline.title" = "MISSION TIMELINE";
"mission.timeline.empty" = "No mission timeline is available yet.";
"mission.timeline.empty.filtered" = "No timeline events match the current filter.";
"mission.timeline.metric.events" = "EVENTS";
"mission.timeline.metric.warnings" = "WARN";
"mission.timeline.metric.critical" = "CRIT";
"mission.timeline.filter.severity" = "SEVERITY";
"mission.timeline.filter.category" = "CATEGORY";
"mission.timeline.filter.severity.all" = "ALL";
"mission.timeline.filter.severity.info" = "INFO";
"mission.timeline.filter.severity.warning" = "WARN";
"mission.timeline.filter.severity.critical" = "CRIT";
"mission.timeline.filter.category.all" = "ALL";
"mission.debrief.title" = "MISSION DEBRIEF";
"mission.debrief.empty" = "No completed mission debrief is available.";
"mission.debrief.metric.duration" = "DURATION";
"mission.debrief.metric.route" = "ROUTE";
"mission.debrief.metric.progress" = "PROGRESS";
"mission.debrief.metric.energy" = "BATTERY";
"mission.debrief.metric.warnings" = "WARNINGS";
"mission.debrief.metric.critical" = "CRITICAL";
"mission.debrief.type.route" = "Route mission";
"mission.debrief.type.delivery" = "Delivery mission";
"mission.debrief.type.constrained" = "Constrained mission";
"mission.debrief.verdict.success" = "Mission completed as planned.";
"mission.debrief.verdict.partial_success" = "Mission completed with degraded or partial outcome.";
"mission.debrief.verdict.aborted" = "Mission ended by operator abort.";
"mission.debrief.verdict.failed" = "Mission ended in failure.";
"mission.debrief.verdict.returned_home" = "Mission stopped and returned home.";
"mission.debrief.verdict.safety_terminated" = "Mission was terminated by safety logic.";
"mission.outcome.success" = "SUCCESS";
"mission.outcome.partial_success" = "PARTIAL";
"mission.outcome.aborted" = "ABORTED";
"mission.outcome.failed" = "FAILED";
"mission.outcome.returned_home" = "RTH";
"mission.outcome.safety_terminated" = "SAFETY";
"tactical.map.legend.toggle" = "Map legend";
"tactical.map.pan.center" = "Center map";

// CAD Design Workshop module
"module.design_workshop.title" = "WORKSHOP";
"module.design_workshop.toolbar_title" = "Workshop";
"module.design_workshop.subtitle" = "Parametric UAV component design";

// CAD asset kinds
"cad.kind.basic_wing" = "Basic Wing";
"cad.kind.frame_plate" = "Frame Plate";
"cad.kind.beam" = "Beam";
"cad.kind.tube" = "Tube";
"cad.kind.mount_bracket" = "Mount Bracket";
"cad.kind.payload_box" = "Payload Box";
"cad.kind.sketch" = "Sketch";

// CAD materials
"cad.material.plastic" = "Plastic";
"cad.material.carbon_fiber" = "Carbon Fiber";
"cad.material.aluminum" = "Aluminum";
"cad.material.steel" = "Steel";
"cad.material.composite" = "Composite";

// CAD attachment roles
"cad.role.frame" = "Frame";
"cad.role.wing" = "Wing";
"cad.role.payload" = "Payload";
"cad.role.camera" = "Camera";
"cad.role.sensor" = "Sensor";
"cad.role.landing_gear" = "Landing Gear";
"cad.role.motor" = "Motor";
"cad.role.battery" = "Battery";
"cad.role.antenna" = "Antenna";
"cad.role.generic" = "Generic";

// CAD document
"cad.document.default_name" = "New Document";

// CAD UI sections and actions
"cad.section.create" = "Create Element";
"cad.section.dimensions" = "Dimensions";
"cad.section.material" = "Material";
"cad.section.mass_info" = "Mass & Bounds";
"cad.section.sketch" = "Sketch";
"cad.section.sketch_line_create" = "New Line";
"cad.section.sketch_lines" = "Sketch Lines";
"cad.action.clear_all" = "Clear All";
"cad.action.delete" = "Delete";
"cad.action.duplicate" = "Duplicate";
"cad.asset.copy_suffix" = "copy";
"cad.asset.unnamed" = "Unnamed Element";

// CAD metrics
"cad.metric.mass" = "Mass";
"cad.metric.material" = "Material";
"cad.metric.bounding" = "Bounds";
"cad.metric.attach_pts" = "Attach Pts";

// CAD parameters
"cad.param.span" = "Span";
"cad.param.root_chord" = "Root Chord";
"cad.param.tip_chord" = "Tip Chord";
"cad.param.thickness" = "Thickness";
"cad.param.sweep" = "Sweep";
"cad.param.dihedral" = "Dihedral";
"cad.param.width" = "Width";
"cad.param.depth" = "Depth";
"cad.param.height" = "Height";
"cad.param.length" = "Length";
"cad.param.outer_radius" = "Outer Radius";
"cad.param.inner_radius" = "Inner Radius";
"cad.param.plate_width" = "Plate Width";
"cad.param.plate_depth" = "Plate Depth";
"cad.param.plate_thickness" = "Plate Thickness";
"cad.param.arm_length" = "Arm Length";
"cad.param.arm_thickness" = "Arm Thickness";

// CAD states
"cad.assets.empty" = "No elements. Create the first component above.";
"cad.selection.empty" = "Select an element from the list or create a new one.";
"cad.selection.empty_hint" = "Create a wing, frame plate, beam, tube, mount bracket, or payload box.";
"cad.assets.empty_short" = "No elements";
"cad.assets.empty_hint" = "Create the first element above.";
"cad.mass.no_selection" = "No element selected";

// CAD Workshop workspace
"cad.workspace.title" = "UAV Design Workshop";
"cad.workspace.back_to_simulation" = "Simulation";
"cad.workspace.open" = "Design Workshop";
"cad.section.elements" = "Elements";
"cad.section.identity" = "Identity";
"cad.field.name" = "Name";
"cad.section.transform" = "Transform";
"cad.transform.position" = "Position";
"cad.transform.rotation" = "Rotation";
"cad.section.attachment_points" = "Attachment Points";
"cad.attachment.count" = "%d points";
"cad.attachment.show" = "Show attachment points";
"cad.attachment.add_short" = "Point";
"cad.attachment.add" = "Add point";
"cad.attachment.custom_base" = "Attachment Point";
"cad.attachment.reset_system" = "Reset system points";
"cad.attachment.empty" = "This element has no attachment points yet.";
"cad.attachment.no_selection" = "Select an attachment point to edit it.";
"cad.attachment.system" = "system";
"cad.attachment.custom" = "custom";
"cad.attachment.enabled" = "Enabled";
"cad.attachment.role" = "Role";
"cad.attachment.delete" = "Delete point";
"cad.attachment.system_delete_disabled" = "System points cannot be deleted";
"cad.canvas.grid" = "Grid";
"cad.canvas.axes" = "Axes";
"cad.canvas.attachment_points" = "Attachment Points";
"cad.canvas.reference_planes" = "Reference Planes";
"cad.canvas.active_plane" = "Plane";
"cad.canvas.active_plane_hidden" = "plane hidden";
"cad.canvas.snap" = "Snap";
"cad.canvas.snap_options" = "Snap Options";
"cad.canvas.grid_step" = "Grid Step";
"cad.canvas.grid.tooltip" = "Show or hide grid";
"cad.canvas.axes.tooltip" = "Show or hide axes";
"cad.canvas.planes.tooltip" = "Show or hide reference planes";
"cad.canvas.points.tooltip" = "Show or hide attachment points";
"cad.canvas.constraint_glyphs" = "Constraints";
"cad.camera.iso.tooltip" = "Isometric view";
"cad.snap.grid" = "Grid";
"cad.snap.sketch_vertex" = "Sketch Point";
"cad.snap.body_vertex" = "Vertex";
"cad.snap.body_edge" = "Edge";
"cad.snap.edge_midpoint" = "Midpoint";
"cad.snap.option.grid" = "Grid";
"cad.snap.option.sketch_vertices" = "Sketch vertices";
"cad.snap.option.body_vertices" = "Body vertices";
"cad.snap.option.body_edges" = "Body edges";
"cad.snap.option.edge_midpoints" = "Edge midpoints";
"cad.snap.construction_vertex" = "Const. Point";
"cad.snap.construction_line" = "Const. Line";
"cad.snap.construction_intersection" = "Intersection";
"cad.snap.option.construction_points" = "Construction points";
"cad.snap.option.construction_lines" = "Construction lines";
"cad.snap.option.construction_intersections" = "Construction intersections";
"cad.construction.mode" = "Mode";
"cad.construction.mode.segment" = "Segment by Two Points";
"cad.construction.mode.horizontal" = "Horizontal Through Point";
"cad.construction.mode.vertical" = "Vertical Through Point";
"cad.construction.mode.angle" = "Point and Angle";
"cad.construction.phase_hint.set_start" = "Click to set reference point";
"cad.construction.phase_hint.set_end" = "Click to set second point";
"cad.construction.angle" = "Angle";
"cad.construction.info" = "Construction geometry is not included in extrusion profiles. Use it as reference for snapping.";
"cad.status.snap_named" = "Snap: %@";
"cad.status.snap_grid_step" = "Snap: Grid %@ mm";
"cad.status.snap_grid_off" = "Snap: grid off";
"cad.canvas.hint" = "Drag to orbit · Scroll to zoom";
"cad.status.no_selection" = "No element selected";
"cad.status.elements" = "%d elements";
"cad.unit.mm" = "mm";
"cad.unit.deg" = "deg";
"cad.unit.grams" = "g";
"cad.unit.kg" = "kg";
"cad.warning.tube_radius" = "Inner radius must be smaller than outer radius.";
"cad.warning.attachment_duplicate_names" = "Attachment point names are duplicated.";
"cad.warning.attachment_all_disabled" = "All attachment points are disabled.";
"cad.warning.attachment_far_from_bounds" = "A custom point is far from the element bounds.";
"cad.warning.attachment_missing_system" = "A required system point is missing. Reset system points.";
"cad.warning.sketch_plane_locked" = "This sketch plane is locked. Create a new sketch for another plane.";
"cad.warning.sketch_plane_locked_hint" = "Plane locked. Use XY / XZ / YZ above to view from a different angle. Create a new sketch for a different plane.";
"cad.warning.constraint_conflict" = "The constraint conflicts with the current geometry.";
"cad.warning.face_required" = "Select a planar face first.";
"cad.info.face_sketch_available" = "You can create a new sketch on the selected face.";

// CAD wing construction types
"cad.construction.solid" = "Solid";
"cad.construction.foam_core" = "Foam Core";
"cad.construction.hollow_composite" = "Hollow Composite";
"cad.construction.rib_and_skin" = "Rib & Skin";
"cad.param.construction" = "Construction";

// CAD camera modes
"cad.camera.iso" = "Iso";
"cad.camera.top" = "Top";
"cad.camera.front" = "Front";
"cad.camera.side" = "Side";
"cad.camera.fit" = "Fit";
"cad.camera.reset" = "Reset";

// CAD sketch mode
"cad.tool.select" = "Select";
"cad.tool.line" = "Line";
"cad.tool.rectangle" = "Rectangle";
"cad.tool.circle" = "Circle";
"cad.tool.arc" = "Arc";
"cad.tool.arc.tooltip" = "Build arc by three points";
"cad.tool.autoline" = "Autoline";
"cad.tool.construction" = "Construction";
"cad.tool.sketch_edit" = "Sketch";
"cad.tool.finish" = "Finish";
"cad.tool.cancel" = "Cancel";
"cad.ribbon.group.select" = "Select";
"cad.ribbon.group.geometry" = "Geometry";
"cad.ribbon.group.sketch" = "Sketch";
"cad.ribbon.group.operations" = "Operations";
"cad.ribbon.group.body" = "Body Features";
"cad.ribbon.group.view" = "View";
"cad.ribbon.group.display" = "Display";
"cad.ribbon.group.snap" = "Snap";
"cad.ribbon.group.templates" = "Templates";
"cad.op.fillet" = "Fillet";
"cad.op.fillet_future" = "Fillet — coming in a future version";
"cad.op.chamfer" = "Chamfer";
"cad.op.chamfer_future" = "Chamfer — coming in a future version";
"cad.templates.button" = "Templates";
"cad.templates.title" = "Templates";
"cad.op.cut" = "Cut";
"cad.op.rib" = "Rib";
"cad.op.cut_future" = "Cut — coming in a future version";
"cad.op.rib_future" = "Rib — coming in a future version";
"cad.sketch.default_name" = "Sketch";
"cad.sketch.new" = "New Sketch";
"cad.sketch.new_on_plane" = "On";
"cad.sketch.face_base_name" = "Face Sketch";
"cad.sketch.face_reference" = "This sketch is attached to a selected solid face.";
"cad.sketch.reference.face" = "Face";
"cad.sketch.plane.xy_view" = "Front";
"cad.sketch.plane.xz_view" = "Top";
"cad.sketch.plane.yz_view" = "Side";
"cad.sketch.plane_offset" = "Plane offset";
"cad.sketch.metric.lines" = "Lines";
"cad.sketch.metric.contour" = "Contour";
"cad.sketch.metric.plane" = "Plane";
"cad.sketch.metric.status" = "Status";
"cad.sketch.definition.under_defined" = "Under-defined";
"cad.sketch.definition.constrained" = "Constrained";
"cad.sketch.definition.conflicting" = "Conflict";
"cad.sketch.extrude_stage" = "Extrude — Stage 1.6";
"cad.sketch.extrude_help_closed" = "The closed contour is ready for extrusion in the next stage.";
"cad.sketch.extrude_help_open" = "Extrusion requires a closed contour.";
"cad.sketch.add_line" = "Add line";
"cad.sketch.lines.empty" = "No lines yet. Enter coordinates and add the first segment.";
"cad.sketch.line_title" = "Line %d";
"cad.sketch.select_next_line" = "Next";
"cad.sketch.delete_line" = "Delete line";
"cad.sketch.massless" = "Sketch without mass";
"cad.sketch.lines_count" = "%d lines";
"cad.sketch.contour.closed" = "closed contour";
"cad.sketch.contour.open" = "open contour";

// CAD project tree
"cad.tree.part" = "Part";
"cad.tree.origin" = "Origin";
"cad.tree.planes" = "Planes";
"cad.tree.axes" = "Axes";
"cad.tree.sketches" = "Sketches";
"cad.tree.elements" = "Elements";
"cad.tree.extruded" = "Extruded";
"cad.tree.extruded_empty" = "No extruded bodies yet.";

// CAD line tool interactive
"cad.line.idle" = "Line tool ready";
"cad.line.set_start" = "Click to set start point";
"cad.line.set_end" = "Click to set end point";
"cad.line.start_point" = "Start";
"cad.line.end_point" = "End";
"cad.line.length" = "Length";
"cad.line.angle" = "Angle";
"cad.line.select_sketch_first" = "Select or create a sketch to draw lines.";
"cad.rectangle.set_first_corner" = "Click to set first corner";
"cad.rectangle.set_opposite_corner" = "Click to set opposite corner";
"cad.rectangle.width" = "W";
"cad.rectangle.height" = "H";
"cad.rectangle.title" = "Rectangle %d";
"cad.circle.set_center" = "Click to set center";
"cad.circle.set_radius" = "Click to set radius";
"cad.circle.radius" = "R";
"cad.circle.diameter" = "Ø";
"cad.circle.title" = "Circle %d";
"cad.sketch.delete_entity" = "Delete";
"cad.sketch.entity_count" = "%d shapes";
"cad.section.line_params" = "Line Parameters";
"cad.section.selected_sketch_line" = "Sketch Line";
"cad.section.selected_sketch_rectangle" = "Rectangle";
"cad.section.selected_sketch_circle" = "Circle";
"cad.section.sketch_shapes" = "Shapes";
"cad.section.constraints" = "Constraints";
"cad.constraint.horizontal" = "Horizontal";
"cad.constraint.vertical" = "Vertical";
"cad.constraint.fixed_start" = "Fixed Start";
"cad.constraint.fixed_end" = "Fixed End";
"cad.constraint.coincident" = "Coincident";
"cad.constraint.equal_length" = "Equal Length";
"cad.constraint.parallel" = "Parallel";
"cad.constraint.perpendicular" = "Perp.";

// Sketch Dimensions
"cad.dim.line_length" = "Length";
"cad.dim.line_angle" = "Angle";
"cad.dim.horizontal_distance" = "Horiz.";
"cad.dim.vertical_distance" = "Vert.";
"cad.dim.rectangle_width" = "Width";
"cad.dim.rectangle_height" = "Height";
"cad.dim.circle_radius" = "Radius";
"cad.dim.circle_diameter" = "Diameter";

// Cross-sketch snap
"cad.snap.reference_sketch_vertex" = "Ref. Point";
"cad.snap.reference_sketch_edge_midpoint" = "Ref. Mid";
"cad.snap.projected_sketch_vertex" = "Proj. Point";
"cad.snap.projected_sketch_edge_midpoint" = "Proj. Mid";
"cad.snap.option.reference_sketches" = "Reference sketches";
"cad.snap.circle_center" = "Circle Center";
"cad.snap.body_vertex_solid" = "Body Vertex";
"cad.snap.body_edge_midpoint" = "Body Edge Midpoint";
"cad.snap.projected_circle_center" = "Projected Center";

// CAD Extrude
"cad.kind.extruded_solid" = "Extruded Solid";
"cad.section.extrude" = "Extrusion";
"cad.section.extruded_solid" = "Extruded Solid";
"cad.extrude.dir.positive" = "+Normal";
"cad.extrude.dir.negative" = "−Normal";
"cad.extrude.dir.symmetric" = "Symmetric";
"cad.extrude.depth" = "Depth";
"cad.extrude.direction" = "Direction";
"cad.extrude.material" = "Material";
"cad.extrude.action" = "Extrude";
"cad.extrude.contour_closed" = "Contour is closed. Ready to extrude.";
"cad.extrude.contour_open" = "Contour is not closed. Close the sketch before extruding.";
"cad.extrude.unavailable_status" = "extrude unavailable";
"cad.extrude.disconnected_lines" = "The contour is made of disconnected line segments.";
"cad.extrude.duplicate_points" = "The contour contains repeated points.";
"cad.extrude.insufficient_points" = "Not enough points. Extrude requires at least three unique points.";
"cad.extrude.area_too_small" = "Contour area is too small.";
"cad.extrude.self_intersections" = "Self-intersections are not supported yet.";
"cad.extrude.unsupported_contour" = "Extrude v1 supports simple contours made from line segments.";
"cad.extrude.source" = "Source";
"cad.extrude.source_deleted" = "Source deleted";
"cad.extrude.source_deleted_named" = "%@ (source deleted)";
"cad.extrude.source_plane" = "Source plane";
"cad.extrude.profile_points" = "Profile points";
"cad.extrude.volume" = "Volume";
"cad.face.front" = "Front";
"cad.face.back" = "Back";
"cad.face.side_n" = "Side %d";
"cad.face.list" = "Faces";
"cad.face.none" = "No planar faces are available for this solid.";
"cad.face.selected" = "Face selected: %@";
"cad.face.new_sketch" = "New sketch on face";
"cad.face.select_hint" = "Select a face to create a sketch on it.";
"cad.workplane.canonical_name" = "%@ Plane";
"cad.workplane.inspector_title" = "Work Plane";
"cad.workplane.selected" = "Selected Plane";
"cad.workplane.create_sketch" = "Create Sketch";
"cad.workplane.normal" = "Normal";
"cad.workplane.close" = "Close";

"cad.camera.normal_to_sketch" = "Normal to Sketch";
"cad.canvas.view_only" = "view only";
"cad.status.snap_off" = "Snap off";

// Arc tool
"cad.arc.set_start" = "Click to set arc start";
"cad.arc.set_end" = "Click to set arc end";
"cad.arc.set_mid" = "Click to set point on arc";
"cad.arc.mid_point" = "Point on Arc";
"cad.arc.chord_length" = "Chord";
"cad.arc.title" = "Arc %d";
"cad.section.arc_params" = "Arc Parameters";

// Autoline tool
"cad.autoline.idle" = "Click to start autoline";
"cad.autoline.segment_count" = "%d segments";
"cad.autoline.last_point" = "Last Point";
"cad.autoline.next_point" = "Next Point";
"cad.autoline.finish" = "Finish (Open)";
"cad.autoline.finish_close" = "Finish (Close)";
"cad.section.autoline_params" = "Autoline";

// Rectangle input modes
"cad.rectangle.first_corner" = "First Corner";
"cad.rectangle.opposite_corner" = "Opposite Corner";
"cad.rect.mode.two_corners" = "Two Corners";
"cad.rect.mode.center_corner" = "Center + Corner";
"cad.rect.mode.size_first" = "Size from First";
"cad.section.rectangle_params" = "Input Mode";

// Circle input modes
"cad.circle.center" = "Center";
"cad.circle.mode.radius" = "Radius from Center";
"cad.circle.mode.diameter" = "Diameter (2 points)";
"cad.section.circle_params" = "Input Mode";
